aqing1987/s-bt/nRF52832/s_ble_app_advertising_tutorial/main.c
    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated when button is pressed.
 */
static void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break; // BSP_EVENT_SLEEP

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break; // BSP_EVENT_DISCONNECT

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break; // BSP_EVENT_KEY_0

        default:
            break;
    }
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;
		
	
	// variable to hold manufacturer specific data
	ble_advdata_manuf_data_t manuf_data;
	memset(&manuf_data, 0, sizeof(manuf_data));
	
	uint8_t data[] = "SomeData!"; // our data to advertise
	manuf_data.company_identifier = 0x0059; // Nordics company ID
    manuf_data.data.p_data = data;
    manuf_data.data.size = sizeof(data);		

    memset(&init, 0, sizeof(init));

    //init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
	init.advdata.name_type               = BLE_ADVDATA_SHORT_NAME;
	init.advdata.short_name_len          = 2;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;    
	init.advdata.p_manuf_specific_data = &manuf_data;	
	
	int8_t tx_power = -4;
	init.advdata.p_tx_power_level = &tx_power;
	init.advdata.include_appearance = true;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
	//init.config.ble_adv_fast_timeout  = 0;
	
	// prepare the scan response Manufacturer specific data packet	
	ble_advdata_manuf_data_t manuf_data_response;
	memset(&manuf_data_response, 0, sizeof(manuf_data_response));
	
	uint8_t data_response[] = "my hello response"; // remember there is a 0 terminator at the end of string
	manuf_data_response.company_identifier = 0x0059;
	manuf_data_response.data.p_data = data_response;
	manuf_data_response.data.size = sizeof(data_response);
		
	init.srdata.name_type = BLE_ADVDATA_NO_NAME;
	init.srdata.p_manuf_specific_data = &manuf_data_response;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
	ret_code_t err_code;

    // Initialize.
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
	nrf_delay_ms(20);
    gap_params_init();    
    advertising_init();    
    conn_params_init();
    peer_manager_init();
	delete_bonds();
	
	err_code = sd_ble_gap_tx_power_set(-4);
	APP_ERROR_CHECK(err_code);

    // Start execution.
    NRF_LOG_INFO("Template example started.");    
    
	err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
